app/views/general/ranking.html.erb

SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."Institution_ID" = :a1 AND ROWNUM <= 1   [["Institution_ID", 208497]]
---
		 <% if current_user %>
		 <%= link_to "Add", addSchool_path(:user_id=>current_user.id, :school_id=>School.find_by(Institution_ID:school.Institution_ID).id, :name=> school.Institution_Name), method:"post" %>