app/controllers/general_controller.rb

SELECT COUNT(*) FROM "DREAMDESIGN"."SCHOOLS"
SELECT DISTINCT COUNT(DISTINCT "DREAMDESIGN"."SCHOOLS"."ID") FROM "DREAMDESIGN"."SCHOOLS"
---
  def ranking
     @schools=School.all.select(:Institution_ID, :follow, :Institution_Name, :Institution_Address, :Institution_City, :Institution_State, :Institution_Zip,
   :Institution_Phone, :Institution_Web_Address, :Accreditation_Status).uniq.paginate(page: params[:page])

SELECT COUNT(*) FROM "DREAMDESIGN"."SCHOOLS" WHERE ("Institution_Name" LIKE '%Harvard%')
SELECT DISTINCT COUNT(DISTINCT "DREAMDESIGN"."SCHOOLS"."ID") FROM "DREAMDESIGN"."SCHOOLS" WHERE ("Institution_Name" LIKE '%Harvard%')
---
  def index
    @schools = School.search(params[:search]).select(:Institution_ID, :follow, :Institution_Name, :Institution_Address, :Institution_City, :Institution_State, :Institution_Zip,
  :Institution_Phone, :Institution_Web_Address, :Accreditation_Status).uniq.order(:Institution_Name).paginate(:page=>params[:page])