app/controllers/majorrankings_controller.rb

SELECT "DREAMDESIGN"."MAJORRANKINGS".* FROM "DREAMDESIGN"."MAJORRANKINGS"
---
  def index
    @majorrankings = Majorranking.all