app/controllers/my_schools_controller.rb

  def create
    @my_school = MySchool.new(my_school_params)
    @my_school.user_id = current_user.id
    @school = School.find_by id:@my_school.school_id
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

  def addSchool
    @my_school = MySchool.new
    @my_school.user_id = current_user.id
    @my_school.name = params[:name]
    @my_school.school_id = params[:school_id]
    @school = School.find_by ID:params[:school_id]

    if @my_school.save
      num = @school.follow
      num += 1
      @school.update(follow:num)
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."ID" = :a1 AND ROWNUM <= 1   [["id", 1]]
INSERT INTO "MY_SCHOOLS" ("CREATED_AT", "ID", "NAME", "SCHOOL_ID", "UPDATED_AT", "USER_ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["created_at", 2014-11-25 02:04:30 UTC], ["id", 28], ["name", "Jefferson State Community College"], ["school_id", 166], ["updated_at", 2014-11-25 02:04:30 UTC], ["user_id", 118]]
UPDATE "DREAMDESIGN"."SCHOOLS" SET "FOLLOW" = :a1, "UPDATED_AT" = :a2 WHERE "DREAMDESIGN"."SCHOOLS"."ID" = 166  [["follow", 1], ["updated_at", Tue, 25 Nov 2014 02:04:30 UTC +00:00]]