app/controllers/recommendeduniversities_controller.rb

  def index
    @recommendeduniversities = Recommendeduniversity.all
---
SELECT "DREAMDESIGN"."RECOMMENDEDUNIVERSITIES".* FROM "DREAMDESIGN"."RECOMMENDEDUNIVERSITIES"