app/controllers/schools_controller.rb

SELECT "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS"
---
  def index
    @schools = School.all