app/controllers/users_controller.rb

SELECT "DREAMDESIGN.SCHOOLS".* FROM "DREAMDESIGN.SCHOOLS"
SELECT "MY_SCHOOLS".* FROM "MY_SCHOOLS" WHERE "MY_SCHOOLS"."USER_ID" = :a1  ORDER BY created_at DESC  [["user_id", 41]]
---
  def mylist
    @my_school = current_user.my_schools.build
    @videos=current_user.videos
    @hot_schools=[]
    current_user.following.each do |user|