app/views/layouts/_header.html.erb

					<% if user_signed_in? %>
						<li><%= link_to "My list (" + current_user.my_schools.count.to_s + ")", mylist_path %></li>
---
SELECT COUNT(*) FROM "MY_SCHOOLS" WHERE "MY_SCHOOLS"."USER_ID" = :a1  [["user_id", 29]]